<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Μηνύματα ταυτοποίησης
    |--------------------------------------------------------------------------
    |
    | Τα ακόλουθα μηνύματα χρησιμοποιούνται από τον μηχανισμό ταυτοποίησης
    | όταν η σύνδεση ενός χρήστη δεν μπορεί να ολοκληρωθεί.
    |
    */

    'failed' => 'Τα στοιχεία σύνδεσης δεν αντιστοιχούν στα αρχεία μας.',
    'password' => 'Ο κωδικός πρόσβασης που δώσατε είναι λανθασμένος.',
    'throttle' => 'Έχουν πραγματοποιηθεί πάρα πολλές προσπάθειες σύνδεσης. Δοκιμάστε ξανά σε :seconds δευτερόλεπτα.',

];
