<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Μηνύματα επαναφοράς κωδικού πρόσβασης
    |--------------------------------------------------------------------------
    |
    | Τα ακόλουθα μηνύματα αντιστοιχούν στα αποτελέσματα μιας προσπάθειας
    | επαναφοράς ή αλλαγής του κωδικού πρόσβασης.
    |
    */

    'reset' => 'Ο κωδικός πρόσβασής σας επαναφέρθηκε.',
    'sent' => 'Ο σύνδεσμος επαναφοράς του κωδικού πρόσβασης στάλθηκε στη διεύθυνση email σας.',
    'throttled' => 'Περιμένετε λίγο πριν προσπαθήσετε ξανά.',
    'token' => 'Ο σύνδεσμος επαναφοράς κωδικού πρόσβασης δεν είναι έγκυρος.',
    'user' => 'Δεν βρέθηκε χρήστης με αυτή τη διεύθυνση email.',

];
