<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Μηνύματα επικύρωσης
    |--------------------------------------------------------------------------
    |
    | Τα ακόλουθα μηνύματα χρησιμοποιούνται από τον μηχανισμό επικύρωσης
    | του Laravel. Ορισμένοι κανόνες έχουν διαφορετικά μηνύματα ανάλογα
    | με τον τύπο της τιμής που επικυρώνεται.
    |
    */

    'accepted' => 'Πρέπει να αποδεχθείτε το πεδίο :attribute.',
    'accepted_if' => 'Πρέπει να αποδεχθείτε το πεδίο :attribute όταν το πεδίο :other είναι :value.',
    'active_url' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση URL.',
    'after' => 'Το πεδίο :attribute πρέπει να είναι ημερομηνία μεταγενέστερη της :date.',
    'after_or_equal' => 'Το πεδίο :attribute πρέπει να είναι ημερομηνία μεταγενέστερη ή ίση με την :date.',
    'alpha' => 'Το πεδίο :attribute πρέπει να περιέχει μόνο γράμματα.',
    'alpha_dash' => 'Το πεδίο :attribute πρέπει να περιέχει μόνο γράμματα, αριθμούς, παύλες και κάτω παύλες.',
    'alpha_num' => 'Το πεδίο :attribute πρέπει να περιέχει μόνο γράμματα και αριθμούς.',
    'any_of' => 'Το πεδίο :attribute δεν είναι έγκυρο.',
    'array' => 'Το πεδίο :attribute πρέπει να είναι πίνακας.',
    'array_keys' => 'Το πεδίο :attribute πρέπει να περιέχει μόνο τα ακόλουθα κλειδιά: :values.',
    'ascii' => 'Το πεδίο :attribute πρέπει να περιέχει μόνο αλφαριθμητικούς χαρακτήρες και σύμβολα ενός byte.',
    'base64' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη συμβολοσειρά Base64.',
    'before' => 'Το πεδίο :attribute πρέπει να είναι ημερομηνία προγενέστερη της :date.',
    'before_or_equal' => 'Το πεδίο :attribute πρέπει να είναι ημερομηνία προγενέστερη ή ίση με την :date.',
    'between' => [
        'array' => 'Το πεδίο :attribute πρέπει να περιέχει από :min έως :max στοιχεία.',
        'file' => 'Το πεδίο :attribute πρέπει να έχει μέγεθος από :min έως :max kilobytes.',
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι από :min έως :max.',
        'string' => 'Το πεδίο :attribute πρέπει να περιέχει από :min έως :max χαρακτήρες.',
    ],
    'boolean' => 'Το πεδίο :attribute πρέπει να είναι αληθές ή ψευδές.',
    'can' => 'Το πεδίο :attribute περιέχει μη εξουσιοδοτημένη τιμή.',
    'confirmed' => 'Η επιβεβαίωση του πεδίου :attribute δεν ταιριάζει.',
    'contains' => 'Από το πεδίο :attribute λείπει μια υποχρεωτική τιμή.',
    'current_password' => 'Ο κωδικός πρόσβασης είναι λανθασμένος.',
    'date' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη ημερομηνία.',
    'date_equals' => 'Το πεδίο :attribute πρέπει να είναι ημερομηνία ίση με την :date.',
    'date_format' => 'Το πεδίο :attribute πρέπει να έχει τη μορφή :format.',
    'decimal' => 'Το πεδίο :attribute πρέπει να έχει :decimal δεκαδικά ψηφία.',
    'declined' => 'Το πεδίο :attribute πρέπει να απορριφθεί.',
    'declined_if' => 'Το πεδίο :attribute πρέπει να απορριφθεί όταν το πεδίο :other είναι :value.',
    'different' => 'Τα πεδία :attribute και :other πρέπει να είναι διαφορετικά.',
    'digits' => 'Το πεδίο :attribute πρέπει να αποτελείται από :digits ψηφία.',
    'digits_between' => 'Το πεδίο :attribute πρέπει να αποτελείται από :min έως :max ψηφία.',
    'dimensions' => 'Το πεδίο :attribute έχει μη έγκυρες διαστάσεις εικόνας.',
    'distinct' => 'Το πεδίο :attribute περιέχει διπλότυπη τιμή.',
    'doesnt_contain' => 'Το πεδίο :attribute δεν πρέπει να περιέχει καμία από τις ακόλουθες τιμές: :values.',
    'doesnt_end_with' => 'Το πεδίο :attribute δεν πρέπει να τελειώνει με μία από τις ακόλουθες τιμές: :values.',
    'doesnt_start_with' => 'Το πεδίο :attribute δεν πρέπει να αρχίζει με μία από τις ακόλουθες τιμές: :values.',
    'email' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση email.',
    'encoding' => 'Το πεδίο :attribute πρέπει να έχει κωδικοποίηση :encoding.',
    'ends_with' => 'Το πεδίο :attribute πρέπει να τελειώνει με μία από τις ακόλουθες τιμές: :values.',
    'enum' => 'Η επιλεγμένη τιμή για το πεδίο :attribute δεν είναι έγκυρη.',
    'exists' => 'Η επιλεγμένη τιμή για το πεδίο :attribute δεν είναι έγκυρη.',
    'extensions' => 'Το πεδίο :attribute πρέπει να είναι αρχείο με μία από τις ακόλουθες επεκτάσεις: :values.',
    'file' => 'Το πεδίο :attribute πρέπει να είναι αρχείο.',
    'filled' => 'Το πεδίο :attribute πρέπει να έχει τιμή.',
    'gt' => [
        'array' => 'Το πεδίο :attribute πρέπει να περιέχει περισσότερα από :value στοιχεία.',
        'file' => 'Το πεδίο :attribute πρέπει να είναι μεγαλύτερο από :value kilobytes.',
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μεγαλύτερο από :value.',
        'string' => 'Το πεδίο :attribute πρέπει να περιέχει περισσότερους από :value χαρακτήρες.',
    ],
    'gte' => [
        'array' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον :value στοιχεία.',
        'file' => 'Το πεδίο :attribute πρέπει να είναι μεγαλύτερο ή ίσο με :value kilobytes.',
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μεγαλύτερο ή ίσο με :value.',
        'string' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον :value χαρακτήρες.',
    ],
    'hex_color' => 'Το πεδίο :attribute πρέπει να είναι έγκυρο δεκαεξαδικό χρώμα.',
    'image' => 'Το πεδίο :attribute πρέπει να είναι εικόνα.',
    'in' => 'Η επιλεγμένη τιμή για το πεδίο :attribute δεν είναι έγκυρη.',
    'in_array' => 'Το πεδίο :attribute πρέπει να υπάρχει στο πεδίο :other.',
    'in_array_keys' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον ένα από τα ακόλουθα κλειδιά: :values.',
    'integer' => 'Το πεδίο :attribute πρέπει να είναι ακέραιος αριθμός.',
    'ip' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση IP.',
    'ipv4' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση IPv4.',
    'ipv6' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση IPv6.',
    'json' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη συμβολοσειρά JSON.',
    'list' => 'Το πεδίο :attribute πρέπει να είναι λίστα.',
    'lowercase' => 'Το πεδίο :attribute πρέπει να είναι γραμμένο με πεζά γράμματα.',
    'lt' => [
        'array' => 'Το πεδίο :attribute πρέπει να περιέχει λιγότερα από :value στοιχεία.',
        'file' => 'Το πεδίο :attribute πρέπει να είναι μικρότερο από :value kilobytes.',
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μικρότερο από :value.',
        'string' => 'Το πεδίο :attribute πρέπει να περιέχει λιγότερους από :value χαρακτήρες.',
    ],
    'lte' => [
        'array' => 'Το πεδίο :attribute δεν πρέπει να περιέχει περισσότερα από :value στοιχεία.',
        'file' => 'Το πεδίο :attribute πρέπει να είναι μικρότερο ή ίσο με :value kilobytes.',
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μικρότερο ή ίσο με :value.',
        'string' => 'Το πεδίο :attribute δεν πρέπει να περιέχει περισσότερους από :value χαρακτήρες.',
    ],
    'mac_address' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση MAC.',
    'max' => [
        'array' => 'Το πεδίο :attribute δεν πρέπει να περιέχει περισσότερα από :max στοιχεία.',
        'file' => 'Το πεδίο :attribute δεν πρέπει να είναι μεγαλύτερο από :max kilobytes.',
        'numeric' => 'Το πεδίο :attribute δεν πρέπει να είναι μεγαλύτερο από :max.',
        'string' => 'Το πεδίο :attribute δεν πρέπει να περιέχει περισσότερους από :max χαρακτήρες.',
    ],
    'max_digits' => 'Το πεδίο :attribute δεν πρέπει να αποτελείται από περισσότερα από :max ψηφία.',
    'mimes' => 'Το πεδίο :attribute πρέπει να είναι αρχείο τύπου: :values.',
    'mimetypes' => 'Το πεδίο :attribute πρέπει να είναι αρχείο τύπου: :values.',
    'min' => [
        'array' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον :min στοιχεία.',
        'file' => 'Το πεδίο :attribute πρέπει να είναι τουλάχιστον :min kilobytes.',
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι τουλάχιστον :min.',
        'string' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον :min χαρακτήρες.',
    ],
    'min_digits' => 'Το πεδίο :attribute πρέπει να αποτελείται από τουλάχιστον :min ψηφία.',
    'missing' => 'Το πεδίο :attribute πρέπει να απουσιάζει.',
    'missing_if' => 'Το πεδίο :attribute πρέπει να απουσιάζει όταν το πεδίο :other είναι :value.',
    'missing_unless' => 'Το πεδίο :attribute πρέπει να απουσιάζει εκτός αν το πεδίο :other είναι :value.',
    'missing_with' => 'Το πεδίο :attribute πρέπει να απουσιάζει όταν υπάρχει το πεδίο :values.',
    'missing_with_all' => 'Το πεδίο :attribute πρέπει να απουσιάζει όταν υπάρχουν τα πεδία :values.',
    'multiple_of' => 'Το πεδίο :attribute πρέπει να είναι πολλαπλάσιο του :value.',
    'not_in' => 'Η επιλεγμένη τιμή για το πεδίο :attribute δεν είναι έγκυρη.',
    'not_regex' => 'Η μορφή του πεδίου :attribute δεν είναι έγκυρη.',
    'numeric' => 'Το πεδίο :attribute πρέπει να είναι αριθμός.',
    'password' => [
        'letters' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον ένα γράμμα.',
        'mixed' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον ένα κεφαλαίο και ένα πεζό γράμμα.',
        'numbers' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον έναν αριθμό.',
        'symbols' => 'Το πεδίο :attribute πρέπει να περιέχει τουλάχιστον ένα σύμβολο.',
        'uncompromised' => 'Το πεδίο :attribute έχει εμφανιστεί σε διαρροή δεδομένων. Επιλέξτε διαφορετική τιμή για το πεδίο :attribute.',
    ],
    'present' => 'Το πεδίο :attribute πρέπει να υπάρχει.',
    'present_if' => 'Το πεδίο :attribute πρέπει να υπάρχει όταν το πεδίο :other είναι :value.',
    'present_unless' => 'Το πεδίο :attribute πρέπει να υπάρχει εκτός αν το πεδίο :other είναι :value.',
    'present_with' => 'Το πεδίο :attribute πρέπει να υπάρχει όταν υπάρχει το πεδίο :values.',
    'present_with_all' => 'Το πεδίο :attribute πρέπει να υπάρχει όταν υπάρχουν τα πεδία :values.',
    'prohibited' => 'Το πεδίο :attribute απαγορεύεται.',
    'prohibited_if' => 'Το πεδίο :attribute απαγορεύεται όταν το πεδίο :other είναι :value.',
    'prohibited_if_accepted' => 'Το πεδίο :attribute απαγορεύεται όταν το πεδίο :other έχει γίνει αποδεκτό.',
    'prohibited_if_declined' => 'Το πεδίο :attribute απαγορεύεται όταν το πεδίο :other έχει απορριφθεί.',
    'prohibited_unless' => 'Το πεδίο :attribute απαγορεύεται εκτός αν το πεδίο :other περιλαμβάνεται στις τιμές :values.',
    'prohibits' => 'Το πεδίο :attribute απαγορεύει την παρουσία του πεδίου :other.',
    'regex' => 'Η μορφή του πεδίου :attribute δεν είναι έγκυρη.',
    'required' => 'Το πεδίο :attribute είναι υποχρεωτικό.',
    'required_array_keys' => 'Το πεδίο :attribute πρέπει να περιέχει καταχωρίσεις για: :values.',
    'required_if' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν το πεδίο :other είναι :value.',
    'required_if_accepted' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν το πεδίο :other έχει γίνει αποδεκτό.',
    'required_if_declined' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν το πεδίο :other έχει απορριφθεί.',
    'required_unless' => 'Το πεδίο :attribute είναι υποχρεωτικό εκτός αν το πεδίο :other περιλαμβάνεται στις τιμές :values.',
    'required_with' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν υπάρχει το πεδίο :values.',
    'required_with_all' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν υπάρχουν τα πεδία :values.',
    'required_without' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν δεν υπάρχει το πεδίο :values.',
    'required_without_all' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν δεν υπάρχει κανένα από τα πεδία :values.',
    'same' => 'Το πεδίο :attribute πρέπει να ταιριάζει με το πεδίο :other.',
    'size' => [
        'array' => 'Το πεδίο :attribute πρέπει να περιέχει :size στοιχεία.',
        'file' => 'Το πεδίο :attribute πρέπει να έχει μέγεθος :size kilobytes.',
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι :size.',
        'string' => 'Το πεδίο :attribute πρέπει να αποτελείται από :size χαρακτήρες.',
    ],
    'starts_with' => 'Το πεδίο :attribute πρέπει να αρχίζει με μία από τις ακόλουθες τιμές: :values.',
    'string' => 'Το πεδίο :attribute πρέπει να είναι συμβολοσειρά.',
    'timezone' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη ζώνη ώρας.',
    'unique' => 'Η τιμή του πεδίου :attribute χρησιμοποιείται ήδη.',
    'uploaded' => 'Η μεταφόρτωση του πεδίου :attribute απέτυχε.',
    'uppercase' => 'Το πεδίο :attribute πρέπει να είναι γραμμένο με κεφαλαία γράμματα.',
    'url' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση URL.',
    'ulid' => 'Το πεδίο :attribute πρέπει να είναι έγκυρο ULID.',
    'uuid' => 'Το πεδίο :attribute πρέπει να είναι έγκυρο UUID.',

    /*
    |--------------------------------------------------------------------------
    | Προσαρμοσμένα μηνύματα επικύρωσης
    |--------------------------------------------------------------------------
    */

    'custom' => [],

    /*
    |--------------------------------------------------------------------------
    | Ονομασίες πεδίων
    |--------------------------------------------------------------------------
    |
    | Οι ονομασίες αυτές αντικαθιστούν τα εσωτερικά αγγλικά ονόματα των
    | πεδίων μέσα στα μηνύματα επικύρωσης.
    |
    */

    'attributes' => [
        'name' => 'όνομα',
        'email' => 'διεύθυνση email',
        'password' => 'κωδικός πρόσβασης',
        'password_confirmation' => 'επιβεβαίωση κωδικού πρόσβασης',
        'role' => 'ρόλος',
        'protocol_number' => 'αριθμός πρωτοκόλλου',
        'protocol_year' => 'έτος πρωτοκόλλου',
        'protocol_date' => 'ημερομηνία πρωτοκόλλου',
        'direction' => 'κατεύθυνση',
        'subject' => 'θέμα',
        'sender' => 'αποστολέας',
        'recipient' => 'παραλήπτης',
        'notes' => 'σημειώσεις',
        'archive_folder_id' => 'φάκελος αρχειοθέτησης',
        'attachments' => 'συνημμένα αρχεία',
        'attachments.*' => 'συνημμένο αρχείο',
        'handler_id' => 'χειριστής',
        'processing_assignee_id' => 'υπεύθυνος διεκπεραίωσης',
        'information_recipient_ids' => 'αποδέκτες προς ενημέρωση',
        'information_recipient_ids.*' => 'αποδέκτης προς ενημέρωση',
        'due_at' => 'προθεσμία διεκπεραίωσης',
        'due_date' => 'προθεσμία',
        'status' => 'κατάσταση',
    ],

    /*
    |--------------------------------------------------------------------------
    | Ονομασίες τιμών
    |--------------------------------------------------------------------------
    |
    | Οι τιμές της βάσης δεδομένων παραμένουν στα αγγλικά, αλλά εμφανίζονται
    | στα ελληνικά όταν περιλαμβάνονται σε μήνυμα επικύρωσης.
    |
    */

    'values' => [
        'direction' => [
            'incoming' => 'Εισερχόμενο',
            'outgoing' => 'Εξερχόμενο',
        ],
        'role' => [
            'administrator' => 'Διαχειριστής',
            'assigner' => 'Υπεύθυνος Ανάθεσης',
            'protocol_officer' => 'Συγγραφέας',
            'viewer' => 'Αναγνώστης',
        ],
    ],

];
